Revit 2027 API
BuiltInFailures.FamilyFailures.WhileScanningParametersForType Property
 While loading Type '[Name]', parameter '[Name]': [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WhileScanningParametersForType { get; }
Public Shared ReadOnly Property WhileScanningParametersForType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WhileScanningParametersForType {
	FailureDefinitionId^ get ();
}
static member WhileScanningParametersForType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace